Refactor README
